runs/figure4Validation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   0.001;

vertices
(
    (0    -0.75 -0.75)
    (2.1  -0.75 -0.75)
    (2.1   0.75 -0.75)
    (0     0.75 -0.75)
    (0    -0.75  0.75)
    (2.1  -0.75  0.75)
    (2.1   0.75  0.75)
    (0     0.75  0.75)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (56 40 40) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 3 7 4)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 5 6 2)
        );
    }

    yMin
    {
        type symmetryPlane;
        faces
        (
            (0 4 5 1)
        );
    }

    yMax
    {
        type symmetryPlane;
        faces
        (
            (3 2 6 7)
        );
    }

    zMin
    {
        type symmetryPlane;
        faces
        (
            (0 1 2 3)
        );
    }

    zMax
    {
        type symmetryPlane;
        faces
        (
            (4 7 6 5)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
