runs/figure4Validation/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1e-4 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (1e-4 0 0);
    }

    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (1e-4 0 0);
        inletValue      uniform (1e-4 0 0);
    }

    sphere
    {
        type            noSlip;
    }

    yMin
    {
        type            symmetryPlane;
    }

    yMax
    {
        type            symmetryPlane;
    }

    zMin
    {
        type            symmetryPlane;
    }

    zMax
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
