runs/figure4Validation/0/Ccation
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Ccation;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0.32;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.32;
    }

    outlet
    {
        type            zeroGradient;
    }

    sphere
    {
        type            zeroGradient;
    }

    yMin
    {
        type            symmetryPlane;
    }

    yMax
    {
        type            symmetryPlane;
    }

    zMin
    {
        type            symmetryPlane;
    }

    zMax
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
