runs/figure4Validation/0/areaDensityGrad
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      areaDensityGrad;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inlet
    {
        type            zeroGradient;
        value           uniform 0;
    }

    outlet
    {
        type            zeroGradient;
        value           uniform 0;
    }

    sphere
    {
        type            zeroGradient;
        value           uniform 0;
    }

    yMin
    {
        type            symmetryPlane;
    }

    yMax
    {
        type            symmetryPlane;
    }

    zMin
    {
        type            symmetryPlane;
    }

    zMax
    {
        type            symmetryPlane;
    }
}

// ************************************************************************* //
