runs/figure4Validation/Allrun
#!/bin/sh
cd ${0%/*} || exit 1
. $WM_PROJECT_DIR/bin/tools/RunFunctions

runApplication blockMesh
runApplication snappyHexMesh -overwrite
runApplication checkMesh
runApplication $(getApplication)

#------------------------------------------------------------------------------
